# Алгоритмы на Python 3. Лекция №2
# Практика: http://judge.mipt.ru/mipt_cs_on_python3/
# Видео - https://www.youtube.com/watch?v=ZgSx3yH7sJI
# Практика - https://github.com/mipt-cs/course-site-python3/wiki

# курс: Информатика. Алгоритмы и структуры данных на Python 3.
# прочитана 12.09.2017
# лектор: Хирьянов Тимофей Фёдорович

# Темы, рассмотренные на лекции №2:
# - Основы алгебры логики.
# - Таблицы истинности и логически законы.
# - Дизъюнктивная нормальная форма.
# - Тип данных bool. Константы True, False. Логические операции в Python.
# - Проверка последовательности на наличие числа x%10==0.
# - Проверка последовательности на то, что все числа делятся на 10.
# - Последовательные и вложенные условные инструкции.
# - Каскадные условные инструкции, оператор elif.