# Алгоритмы на Python 3. Лекция №1
# Практика: http://judge.mipt.ru/mipt_cs_on_python3/
# Видео - https://www.youtube.com/watch?v=KdZ4HF1SrFs
# Практика - https://github.com/mipt-cs/course-site-python3/wiki

# курс: Информатика. Алгоритмы и структуры данных на Python 3.
# лектор: Хирьянов Тимофей Фёдорович
# прочитана 05.09.2017

# Темы, рассмотренные на лекции №1:
# - Что есть "информатика" и что понимает под этим лектор
# - Что значит "уметь программировать"
# - Hello, World!
# - Концепция присваивания в Python
# - Обмен двух переменных значениями через одну временную и две временные переменные.
# - Множественное присваивание в кортежи переменных. 
# - Обмен значений.
# - Арифметические операции. Возведение в степень, деление нацело.
# - Цикл while. Инструкции управления циклом.
# - Вложенный цикл while
# - Условный оператор if
# - Цикл for и его особенности в Python.
# - Функция range()
# - Оператор continue

print('Hello, World!')